{
    "debug_shortpath": "Geeft het pad van de bovenliggende map en het bestand terug van een gegeven bestandspad, of 'unknown' als het pad niet is opgegeven.",
    "phlo_app_jsonfile": "Laadt een JSON-bestand, vervangt een specifieke string met een app-naam, decodeert de inhoud en roept vervolgens een andere functie aan met de resulterende gegevens.",
    "apply": "Deze functie accepteert een variabel aantal commando's, past indien nodig debug-instellingen toe, en retourneert deze als een JSON-object met specifieke HTTP-headers.",
    "chunk": "De functie verdeelt een lijst van commando's in chunks, verzendt deze als een JSON-gestreamde respons met specifieke headers, en zorgt ervoor dat de output direct naar de client wordt verzonden.",
    "output": "Verzendt inhoud of een bestand naar de browser met de juiste headers voor type, lengte en weergaveopties.",
    "error": "Gooit een PhloException met een opgegeven foutmelding en statuscode.",
    "arr": "Geeft een array terug met de meegegeven argumenten.",
    "obj": "Maakt een nieuwe instantie van de `obj`-klasse aan met de meegegeven argumenten.",
    "json_read": "Leest een JSON-bestand en decodeert de inhoud, waarbij een foutmelding wordt gegeven als het lezen of decoderen mislukt.",
    "json_write": "Schrijft geserialiseerde JSON-gegevens naar een bestand met exclusieve vergrendeling.",
    "first": "Geeft het eerste element van de meegegeven argumenten terug.",
    "last": "Geeft het laatste element van de meegegeven argumenten terug.",
    "phlo_exec": "Voert een PHP-script uit met opgegeven parameters en retourneert de uitvoer of een status, afhankelijk van de synchronisatiemodus.",
    "phlo_sync": "Synchroniseert een object met een externe bron door een specifieke aanroep uit te voeren met de meegegeven argumenten.",
    "phlo_async": "Voert een asynchrone uitvoering uit van een opgegeven methode op een object met optionele argumenten.",
    "phlo_exists": "Controleert of een PHP-bestand bestaat op basis van een gegeven objectnaam door deze om te zetten naar een bestandsnaam.",
    "DOM": "Genereert een HTML-document met opgegeven inhoud voor de `<head>` en `<body>`, inclusief taalinstelling en optionele attributen voor de `<body>`.",
    "tag": "Genereert een HTML-tag met een opgegeven naam, optionele inhoud en een variabel aantal attributen, waarbij null-waarden worden genegeerd en attributen correct worden geformatteerd.",
    "title": "Voegt een titel toe aan een statische array en retourneert een samengevoegde string van alle titels, of retourneert een standaardtitel als er geen titel is opgegeven.",
    "age": "Berekent het aantal seconden sinds een opgegeven tijdstip.",
    "age_human": "Converteert een leeftijd in seconden naar een leesbare tijdsweergave.",
    "encrypt": "Versleutelt de gegeven data met een sleutel en een willekeurige nonce, en retourneert de versleutelde data als een base64-gecodeerde string.",
    "decrypt": "Decrypt een base64-gecodeerde string met behulp van een geheime sleutel en Sodium's cryptografie, mits de decodering succesvol is en de lengte voldoet aan de vereisten.",
    "active": "Geeft een string terug met een class-attribuut dat 'active' toevoegt als de voorwaarde waar is of als er een classlijst is opgegeven.",
    "apcu": "Slaat een waarde op in de APCu-cache met een opgegeven sleutel en callback, en logt informatie over de opgeslagen waarde indien gewenst.",
    "camel": "Zet een string om naar camelCase door de eerste letter van elke woord te kapitaliseren, de spaties te verwijderen en de eerste letter van de resulterende string in kleine letters te maken.",
    "create": "Maakt een associatieve array door sleutels te genereren met een callback en waarden met een optionele callback, of gebruikt de oorspronkelijke items als waarden.",
    "debug": "Voegt een bericht toe aan een statische array voor debugdoeleinden of retourneert de array als er geen bericht is opgegeven, mits debugmodus is ingeschakeld.",
    "dirs": "Geeft een array terug van alle subdirectories in de opgegeven pad die beginnen met de opgegeven string.",
    "esc": "Converteert speciale HTML-tekens in een string naar hun veilige equivalenten om XSS-aanvallen te voorkomen.",
    "files": "Zoekt naar bestanden met een specifieke extensie in opgegeven paden en retourneert een samengevoegd array van de gevonden bestandsnamen.",
    "indent": "Voegt een opgegeven aantal tabs toe aan het begin van elke regel van de gegeven string.",
    "indentView": "Voegt een specifieke hoeveelheid inspringing toe aan elke regel van een gegeven string, afhankelijk van de opgegeven diepte.",
    "location": "Stelt een HTTP-redirect in naar een opgegeven locatie of de vorige pagina, afhankelijk van de waarde van de parameter.",
    "mime": "Bepaalt de MIME-type op basis van de bestandsextensie van een gegeven bestandsnaam.",
    "req": "De functie retourneert een specifiek deel van een gesplitste string of een samengevoegde substring, afhankelijk van de opgegeven index en lengte.",
    "token": "Genereert een willekeurige token van een opgegeven lengte op basis van een SHA-1 hash van een invoerstring of een random getal.",
    "debug_render": "Genereert een script dat debug-informatie naar de console logt, inclusief geheugenverbruik, DOM-grootte en andere debuggegevens, en verwijdert vervolgens het script-element uit de DOM.",
    "debug_apply": "Voegt debug-informatie en een geformatteerde duur toe aan de gegeven argumenten.",
    "debug_css": "Leest de inhoud van het bestand 'debug.css' en voegt de uitvoer van de functie 'debug_css_highlight()' eraan toe.",
    "debug_css_highlight": "Leest de inhoud van het bestand 'highlight.css' in de huidige directory en retourneert deze als een string.",
    "debug_fn": "Geeft de naam van een methode of functie terug uit een string die een object- of classreferentie bevat, of retourneert de originele string als er geen referentie is.",
    "debug_strip": "Verwijdert `<pre>` en `<code>` HTML-tags uit de gegeven string.",
    "debug_snippet": "Geeft een opgemaakte weergave van een specifieke regel code uit een bestand, inclusief syntaxisaccentuering en normalisatie, of een lege codeblok als de regel niet bestaat.",
    "debug_view_php": "Deze functie leest de inhoud van een PHP-bestand, markeert de syntaxis, normaliseert de weergave, voegt lijnnummers toe en markeert een specifieke regel, waarna het de geformatteerde output retourneert samen met informatie over het bestand en de regel.",
    "debug_view_phlo": "Leest de inhoud van een bestand, markeert de syntaxis, voegt regelnummering toe en retourneert de debug-informatie samen met de gemarkeerde inhoud.",
    "debug_frame": "Genereert een HTML-fragment dat informatie over een stack-frame weergeeft, inclusief een link naar de bestandslocatie en een codefragment, afhankelijk van de bestandsextensie en of het frame actief is.",
    "debug_tab": "Converteert de bestandsnaam van een gegeven pad naar kleine letters en vervangt punten door streepjes.",
    "debug_header": "Geeft een HTML-div terug met de piekgeheugengebruik en de duur van een proces, opgemaakt met specifieke symbolen.",
    "debug_header_errorpage": "Genereert een HTML-header voor een foutpagina met type, bericht, aanvraaginformatie en foutcode.",
    "debug_header_debugpage": "Genereert een HTML-header voor een foutpagina met debug-informatie, inclusief de HTTP-methode en het pad van de aanvraag.",
    "debug_file": "Geeft een HTML-link naar een bestand weer, afhankelijk van de bestandsextensie en of er een bijbehorende debug-link beschikbaar is.",
    "phlo_source": "Deze functie retourneert de waarde van de commentaarregel die begint met '// source: ' uit de eerste 17 regels van een opgegeven PHP-bestand, of null als deze niet bestaat of als de build niet is ingeschakeld.",
    "highlight_PHP": "Deze functie kleurt en formatteert PHP-code als HTML, verwijdert bepaalde HTML-tags en vervangt specifieke entiteiten en spaties door hun overeenkomstige karakters.",
    "highlight_PHP_line": "Deze functie markeert een PHP-regel met syntaxisaccentuering en verwijdert de PHP-tag uit de output.",
    "file_line": "Leest de opgegeven regel uit een bestand en verwijdert overtollige spaties aan het begin en einde, of retourneert niets als de regel niet bestaat.",
    "linenumber": "Genereert een genummerde lijst van HTML-lijnelementen uit een array, met optionele bewerkbaarheid en een prefix voor de ID's.",
    "dr": "Deze functie vangt de uitvoer van `var_dump` van de meegegeven gegevens op en retourneert het als een string zonder extra spaties.",
    "debug_head": "Deze functie retourneert een geformatteerde string met het bestandspad, regelnummer, optionele naam en de inhoud van een specifieke regel uit een bestand.",
    "dc": "Logt de opgegeven gegevens naar de browserconsole, inclusief debug-informatie als beschikbaar.",
    "dx": "Deze functie genereert een gedetailleerde debugpagina met uitvoer, bestandsinformatie en een oproepstack, en toont deze in een webbrowser of console, afhankelijk van de context.",
    "auth_log": "Schrijft een logregel met de huidige datum, gebruikersnaam en IP-adres naar een bestand genaamd 'access.log'."
}